Rm-lee/SeeedStudio-XIAO-ESP32S3-Sense-camera/CameraWebServer_for_esp-arduino_3.0.x/app_httpd.cpp
static esp_err_t pll_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
    "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
    totalX, totalY, outputX, outputY, scale, binning
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) {
    if (s->id.PID == OV3660_PID) {
      return httpd_resp_send(req, (const char *)index_ov3660_html_gz, index_ov3660_html_gz_len);
    } else if (s->id.PID == OV5640_PID) {
      return httpd_resp_send(req, (const char *)index_ov5640_html_gz, index_ov5640_html_gz_len);
    } else {
      return httpd_resp_send(req, (const char *)index_ov2640_html_gz, index_ov2640_html_gz_len);
    }
  } else {
    log_e("Camera sensor not found");
    return httpd_resp_send_500(req);
  }
}

// ---------------------------------------------------------------------------
// /live  — combined camera + mic page (port 80)
// ---------------------------------------------------------------------------
// Raw string literal — must not contain the exact sequence )XHTML" inside.
// Resolution enum from updated sensors.h (Arduino ESP32 3.x / esp32-camera):
//   0=96x96  1=QQVGA  2=128x128  3=QCIF  4=HQVGA  5=240x240  6=QVGA
//   7=320x320  8=CIF  9=HVGA  10=VGA  11=SVGA  12=XGA  13=HD  14=SXGA
//   15=UXGA  16=FHD  17=P_HD  18=P_3MP  19=QXGA   (OV3660 max = 19)
// Camera settings JS is a direct port of the original camera web server page:
//   updateConfig / updateValue / .default-action wiring — no custom ctl() shim.
static const char LIVE_PAGE[] = R"XHTML(
<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>XIAO Cam</title>
<style>
*{box-sizing:border-box;margin:0;padding:0}
body{background:#0a0a14;color:#ccc;font-family:-apple-system,BlinkMacSystemFont,sans-serif;display:flex;height:100vh;overflow:hidden}
#sb{width:272px;min-width:272px;background:#0c0c1a;border-right:1px solid #1e1e38;overflow-y:auto;transition:.2s;display:flex;flex-direction:column;flex-shrink:0}
#sb.hide{width:36px;min-width:36px;overflow:hidden}
#tb{position:sticky;top:0;background:#0c0c1a;border:none;color:#7ab;font-size:14px;padding:8px 10px;cursor:pointer;width:100%;text-align:right;border-bottom:1px solid #1e1e38;white-space:nowrap;z-index:1}
#sb.hide #tb{text-align:center;padding:8px 0}
#sbc{padding:5px}
#sb.hide #sbc{display:none}
.gh{background:#181830;color:#89b;padding:5px 8px;border-radius:4px;cursor:pointer;font-size:11px;font-weight:700;text-transform:uppercase;letter-spacing:.7px;display:flex;justify-content:space-between;user-select:none;margin-top:4px}
.gc{padding:2px 0 4px}
.grp.off .gc{display:none}
.cr{display:flex;align-items:center;gap:5px;padding:2px 2px}
.cr label{width:90px;min-width:90px;color:#777;font-size:11px}
.cr input[type=range]{flex:1;accent-color:#7ab;margin:0}
.cr select{flex:1;background:#181830;color:#ccc;border:1px solid #2a2a50;border-radius:3px;padding:2px 3px;font-size:11px}
.cr input[type=checkbox]{accent-color:#7ab;width:14px;height:14px}
.vl{min-width:34px;text-align:right;color:#7ab;font-size:11px;flex-shrink:0}
.hidden{display:none!important}
#ab{width:100%;border:none;border-radius:5px;padding:6px;font-size:12px;font-weight:600;cursor:pointer;background:#2a5888;color:#fff;margin-bottom:2px}
#ab.on{background:#1e6640}
#ab:hover{filter:brightness(1.2)}
#ast{font-size:10px;color:#555;padding:1px 2px;word-break:break-word;line-height:1.4}
#main{flex:1;display:flex;align-items:center;justify-content:center;background:#000;overflow:hidden;min-width:0}
#sw{position:relative;width:100%;height:100%;display:flex;align-items:center;justify-content:center}
#stream{max-width:100%;max-height:100%;display:block;object-fit:contain}
#fsb{position:absolute;bottom:10px;right:10px;background:rgba(0,0,0,.55);color:#ddd;border:1px solid rgba(255,255,255,.25);border-radius:5px;padding:5px 9px;cursor:pointer;font-size:15px;line-height:1;z-index:5;opacity:.75;transition:opacity .15s}
#fsb:hover{opacity:1}
#sw:-webkit-full-screen,#sw:fullscreen{background:#000;width:100vw;height:100vh}
#sw:-webkit-full-screen #stream,#sw:fullscreen #stream{width:100vw;height:100vh;max-width:100vw;max-height:100vh;object-fit:contain}
#sw:-webkit-full-screen #fsb,#sw:fullscreen #fsb{bottom:16px;right:16px}
@media(max-width:600px){body{flex-direction:column;height:auto;overflow:auto}#sb{width:100%!important;min-width:0!important;border-right:none;border-bottom:1px solid #1e1e38;flex-shrink:0}#sb.hide{overflow:hidden;max-height:38px}#tb{text-align:left;padding:8px 12px}#main{min-height:55vw}}
</style>
</head>
<body>
<div id="sb">
  <button id="tb" onclick="toggleSb()">&#9776; Settings</button>
  <div id="sbc">

    <div class="grp" id="g-aud">
      <div class="gh" onclick="tg('aud')">&#127908; Microphone <span id="a-aud">&#9660;</span></div>
      <div class="gc">
        <div class="cr"><button id="ab" onclick="toggleAudio()">Enable Mic</button></div>
        <div class="cr"><label>Volume</label><input type="range" id="vs" min="0" max="3" step="0.05" value="1" oninput="setVol(this.value);this.nextElementSibling.textContent=(+this.value).toFixed(1)"><span class="vl">1.0</span></div>
        <div id="ast">Audio off</div>
      </div>
    </div>

    <div class="grp" id="g-img">
      <div class="gh" onclick="tg('img')">Image <span id="a-img">&#9660;</span></div>
      <div class="gc">
        <div class="cr"><label>Resolution</label>
          <select id="framesize" class="default-action">
            <option value="19">QXGA 2048&#xD7;1536</option>
            <option value="18">P_3MP 864&#xD7;1536</option>
            <option value="17">P_HD 720&#xD7;1280</option>
            <option value="16">FHD 1920&#xD7;1080</option>
            <option value="15">UXGA 1600&#xD7;1200</option>
            <option value="14">SXGA 1280&#xD7;1024</option>
            <option value="13">HD 1280&#xD7;720</option>
            <option value="12">XGA 1024&#xD7;768</option>
            <option value="11">SVGA 800&#xD7;600</option>
            <option value="10">VGA 640&#xD7;480</option>
            <option value="9">HVGA 480&#xD7;320</option>
            <option value="8">CIF 400&#xD7;296</option>
            <option value="7">320&#xD7;320</option>
            <option value="6">QVGA 320&#xD7;240</option>
            <option value="5">240&#xD7;240</option>
            <option value="4">HQVGA 240&#xD7;176</option>
            <option value="3">QCIF 176&#xD7;144</option>
            <option value="2">128&#xD7;128</option>
            <option value="1">QQVGA 160&#xD7;120</option>
            <option value="0">96&#xD7;96</option>
          </select>
        </div>
        <div class="cr"><label>Quality</label><input type="range" id="quality" min="4" max="63" class="default-action" oninput="this.nextElementSibling.textContent=this.value"><span class="vl">-</span></div>
        <div class="cr"><label>Brightness</label><input type="range" id="brightness" min="-3" max="3" class="default-action" oninput="this.nextElementSibling.textContent=this.value"><span class="vl">-</span></div>
        <div class="cr"><label>Contrast</label><input type="range" id="contrast" min="-3" max="3" class="default-action" oninput="this.nextElementSibling.textContent=this.value"><span class="vl">-</span></div>
        <div class="cr"><label>Saturation</label><input type="range" id="saturation" min="-4" max="4" class="default-action" oninput="this.nextElementSibling.textContent=this.value"><span class="vl">-</span></div>
        <div class="cr"><label>Effect</label>
          <select id="special_effect" class="default-action">
            <option value="0">None</option><option value="1">Negative</option>
            <option value="2">Grayscale</option><option value="3">Red Tint</option>
            <option value="4">Green Tint</option><option value="5">Blue Tint</option>
            <option value="6">Sepia</option>
          </select>
        </div>
        <div class="cr"><label>H-Mirror</label><input type="checkbox" id="hmirror" class="default-action"></div>
        <div class="cr"><label>V-Flip</label><input type="checkbox" id="vflip" class="default-action"></div>
        <div class="cr"><label>Colorbar</label><input type="checkbox" id="colorbar" class="default-action"></div>
      </div>
    </div>

    <div class="grp off" id="g-ae">
      <div class="gh" onclick="tg('ae')">Exposure / Gain <span id="a-ae">&#9650;</span></div>
      <div class="gc">
        <div class="cr"><label>AWB</label><input type="checkbox" id="awb" class="default-action"></div>
        <div class="cr"><label>AWB Gain</label><input type="checkbox" id="awb_gain" class="default-action"></div>
        <div class="cr hidden" id="wb_mode-group"><label>WB Mode</label>
          <select id="wb_mode" class="default-action">
            <option value="0">Auto</option><option value="1">Sunny</option>
            <option value="2">Cloudy</option><option value="3">Office</option>
            <option value="4">Home</option>
          </select>
        </div>
        <div class="cr"><label>AEC Sensor</label><input type="checkbox" id="aec" class="default-action"></div>
        <div class="cr"><label>AEC DSP</label><input type="checkbox" id="aec2" class="default-action"></div>
        <div class="cr"><label>AE Level</label><input type="range" id="ae_level" min="-2" max="2" class="default-action" oninput="this.nextElementSibling.textContent=this.value"><span class="vl">-</span></div>
        <div class="cr" id="aec_value-group"><label>Exposure</label><input type="range" id="aec_value" min="0" max="1200" class="default-action" oninput="this.nextElementSibling.textContent=this.value"><span class="vl">-</span></div>
        <div class="cr"><label>AGC</label><input type="checkbox" id="agc" class="default-action"></div>
        <div class="cr" id="agc_gain-group"><label>AGC Gain</label><input type="range" id="agc_gain" min="0" max="30" class="default-action" oninput="this.nextElementSibling.textContent=this.value"><span class="vl">-</span></div>
        <div class="cr"><label>Gain Ceiling</label>
          <select id="gainceiling" class="default-action">
            <option value="0">2x</option><option value="1">4x</option><option value="2">8x</option>
            <option value="3">16x</option><option value="4">32x</option><option value="5">64x</option>
            <option value="6">128x</option>
          </select>
        </div>
      </div>
    </div>

    <div class="grp off" id="g-fx">
      <div class="gh" onclick="tg('fx')">Filters <span id="a-fx">&#9650;</span></div>
      <div class="gc">
        <div class="cr"><label>BPC</label><input type="checkbox" id="bpc" class="default-action"></div>
        <div class="cr"><label>WPC</label><input type="checkbox" id="wpc" class="default-action"></div>
        <div class="cr"><label>Raw GMA</label><input type="checkbox" id="raw_gma" class="default-action"></div>
        <div class="cr"><label>Lens Corr</label><input type="checkbox" id="lenc" class="default-action"></div>
        <div class="cr"><label>DCW</label><input type="checkbox" id="dcw" class="default-action"></div>
      </div>
    </div>

    <div class="grp off" id="g-led">
      <div class="gh" onclick="tg('led')">LED Flash <span id="a-led">&#9650;</span></div>
      <div class="gc">
        <div class="cr"><label>Intensity</label><input type="range" id="led_intensity" min="0" max="255" class="default-action" oninput="this.nextElementSibling.textContent=this.value"><span class="vl">-</span></div>
      </div>
    </div>

