Rm-lee/SeeedStudio-XIAO-ESP32S3-Sense-camera/CameraWebServer_for_esp-arduino_3.0.x/app_httpd.cpp
  </div>
</div>

<div id="main">
  <div id="sw">
    <img id="stream" src="" alt="Connecting...">
    <button id="fsb" onclick="goFs()" title="Fullscreen">&#x26F6;</button>
  </div>
</div>

<script>
const H=location.hostname;
const SURL='http://'+H+':81/stream';
document.getElementById('stream').src=SURL;

if(window.innerWidth<600)document.getElementById('sb').classList.add('hide');

function toggleSb(){document.getElementById('sb').classList.toggle('hide')}

const grpOpen={aud:true,img:true,ae:false,fx:false,led:false};
function tg(n){
  grpOpen[n]=!grpOpen[n];
  document.getElementById('g-'+n).classList.toggle('off');
  document.getElementById('a-'+n).innerHTML=grpOpen[n]?'&#9660;':'&#9650;';
}

// --- Camera settings: direct port of original camera web server JS ---
const hide=el=>el.classList.add('hidden');
const show=el=>el.classList.remove('hidden');

function updateConfig(el){
  let value;
  switch(el.type){
    case 'checkbox': value=el.checked?1:0; break;
    case 'range': case 'select-one': value=el.value; break;
    default: return;
  }
  fetch('/control?var='+el.id+'&val='+value).catch(()=>{});
}

const updateValue=(el,value,updateRemote)=>{
  updateRemote=updateRemote==null?true:updateRemote;
  let init;
  if(el.type==='checkbox'){
    init=el.checked; value=!!value; el.checked=value;
  } else {
    init=el.value; el.value=value;
    // update display span immediately after the input
    const d=el.nextElementSibling;
    if(d&&d.classList&&d.classList.contains('vl')) d.textContent=value;
  }
  if(updateRemote&&init!==value){
    updateConfig(el);
  } else if(!updateRemote){
    const expG=document.getElementById('aec_value-group');
    const agcG=document.getElementById('agc_gain-group');
    const wbG =document.getElementById('wb_mode-group');
    if(el.id==='aec'){ value?hide(expG):show(expG); }
    else if(el.id==='agc'){ value?hide(agcG):show(agcG); }
    else if(el.id==='awb_gain'){ value?show(wbG):hide(wbG); }
  }
};

// Wire all .default-action elements: onchange → updateConfig
document.querySelectorAll('.default-action').forEach(el=>{
  el.onchange=()=>updateConfig(el);
});

// Custom overrides (must come after generic wiring above to take effect)
const aecEl=document.getElementById('aec');
aecEl.onchange=()=>{
  updateConfig(aecEl);
  const expG=document.getElementById('aec_value-group');
  aecEl.checked?hide(expG):show(expG);
};

const agcEl=document.getElementById('agc');
agcEl.onchange=()=>{
  updateConfig(agcEl);
  const agcG=document.getElementById('agc_gain-group');
  agcEl.checked?hide(agcG):show(agcG);
};

const awbGainEl=document.getElementById('awb_gain');
awbGainEl.onchange=()=>{
  updateConfig(awbGainEl);
  const wbG=document.getElementById('wb_mode-group');
  awbGainEl.checked?show(wbG):hide(wbG);
};

// Resolution: send control then restart stream so camera pipeline resets cleanly
const framesizeEl=document.getElementById('framesize');
framesizeEl.onchange=()=>{
  const img=document.getElementById('stream');
  img.src='';
  fetch('/control?var=framesize&val='+framesizeEl.value)
    .finally(()=>setTimeout(()=>{img.src=SURL;},500));
};

// Populate all controls from /status (same pattern as original page)
fetch('/status').then(r=>r.json()).then(state=>{
  document.querySelectorAll('.default-action').forEach(el=>{
    const v=state[el.id];
    if(v===undefined) return;
    if(el.id==='led_intensity'&&v<0) return; // LED not available on this build
    updateValue(el,v,false);
  });
}).catch(()=>{});

// Fullscreen — toggle enter/exit
function goFs(){
  const fs=!!(document.fullscreenElement||document.webkitFullscreenElement);
  if(fs){
    (document.exitFullscreen||document.webkitExitFullscreen||document.mozCancelFullScreen||document.msExitFullscreen||function(){}).call(document);
  } else {
    const el=document.getElementById('sw');
    (el.requestFullscreen||el.webkitRequestFullscreen||el.mozRequestFullScreen||el.msRequestFullscreen||function(){}).call(el);
  }
}
['fullscreenchange','webkitfullscreenchange'].forEach(e=>
  document.addEventListener(e,()=>{
    const fs=!!(document.fullscreenElement||document.webkitFullscreenElement);
    document.getElementById('fsb').innerHTML=fs?'&#x2715;':'&#x26F6;';
  })
);

// ---- Audio — pop-fix pipeline ----
// 1. BiquadFilter highpass @80 Hz strips PDM mic DC offset (primary pop cause)
// 2. Fixed 4096-sample windows prevent TCP chunk-size jitter
// 3. 64-sample linear crossfade at buffer edges removes click discontinuities
const PSAMP=4096,FADE=64;
let ctx=null,hpf=null,gain=null,rdr=null,audioOn=false,nxt=0;
let raw=new Uint8Array(PSAMP*2),rawLen=0;

function setVol(v){if(gain)gain.gain.value=+v}
async function toggleAudio(){audioOn?stopAudio():await startAudio()}

async function startAudio(){
  document.getElementById('ast').textContent='Connecting...';
  try{
    ctx=new(window.AudioContext||window.webkitAudioContext)({sampleRate:16000});
    await ctx.resume();
    hpf=ctx.createBiquadFilter();
    hpf.type='highpass';hpf.frequency.value=80;hpf.Q.value=0.707;
    gain=ctx.createGain();
    gain.gain.value=+document.getElementById('vs').value;
    hpf.connect(gain);gain.connect(ctx.destination);
    const resp=await fetch('http://'+H+':82/audio');
    if(!resp.ok)throw new Error('HTTP '+resp.status);
    rdr=resp.body.getReader();
    audioOn=true;nxt=0;rawLen=0;
    document.getElementById('ab').innerHTML='&#128263; Disable Mic';
    document.getElementById('ab').className='on';
    document.getElementById('ast').textContent='Streaming 16kHz mono';
    pump();
  }catch(e){
    document.getElementById('ast').textContent='Error: '+e.message;
    cleanAudio();
  }
}

function schedBuf(){
  const buf=ctx.createBuffer(1,PSAMP,16000);
  const ch=buf.getChannelData(0);
  for(let i=0;i<PSAMP;i++){
    const lo=raw[i*2],hi=raw[i*2+1];
    let s=((hi<<8|lo)<<16>>16)/32768;
    const f=Math.min(i,PSAMP-1-i,FADE);
    if(f<FADE)s*=f/FADE;
    ch[i]=s;
  }
  const src=ctx.createBufferSource();
  src.buffer=buf;src.connect(hpf);
  const now=ctx.currentTime;
  if(nxt<now+0.04)nxt=now+0.12;
  src.start(nxt);nxt+=buf.duration;
}

