Rm-lee/SeeedStudio-XIAO-ESP32S3-Sense-camera/CameraWebServer_for_esp-arduino_3.0.x/app_httpd.cpp
async function pump(){
  while(audioOn){
    let res;try{res=await rdr.read()}catch{break}
    if(res.done)break;
    const d=res.value;
    if(!d||!d.length)continue;
    for(let i=0;i<d.length;i++){
      raw[rawLen++]=d[i];
      if(rawLen>=PSAMP*2){schedBuf();rawLen=0;}
    }
  }
  if(audioOn)document.getElementById('ast').textContent='Stream ended';
}

function stopAudio(){
  audioOn=false;
  if(rdr){rdr.cancel();rdr=null;}
  cleanAudio();
  document.getElementById('ab').innerHTML='Enable Mic';
  document.getElementById('ab').className='';
  document.getElementById('ast').textContent='Audio off';
}
function cleanAudio(){
  if(ctx){ctx.close().catch(()=>{});ctx=null;hpf=null;gain=null;}
  rawLen=0;
}
</script>
</body>
</html>
)XHTML";

static esp_err_t live_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, LIVE_PAGE, (ssize_t)strlen(LIVE_PAGE));
}

// ---------------------------------------------------------------------------
// /audio  — raw 16-bit signed PCM stream at 16 kHz, mono (port 82)
// ---------------------------------------------------------------------------
// 2048 bytes = 1024 int16 samples ≈ 64 ms at 16 kHz.
// Larger reads → fewer TCP frames → less jitter at the browser accumulator.
#define AUDIO_BUF_BYTES 2048

static esp_err_t audio_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "application/octet-stream");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Cache-Control", "no-cache");
  httpd_resp_set_hdr(req, "X-Audio-Format", "pcm-s16le");
  httpd_resp_set_hdr(req, "X-Audio-Sample-Rate", "16000");
  httpd_resp_set_hdr(req, "X-Audio-Channels", "1");

  // Heap-allocated: the default httpd task stack (4 KB) cannot hold a
  // 2048-byte local array plus call overhead without overflowing.
  uint8_t *buf = (uint8_t *)malloc(AUDIO_BUF_BYTES);
  if (!buf) {
    return httpd_resp_send_500(req);
  }

  size_t bytesRead = 0;
  esp_err_t res = ESP_OK;

  while (res == ESP_OK) {
    if (readMicSamples(buf, AUDIO_BUF_BYTES, &bytesRead) && bytesRead > 0) {
      res = httpd_resp_send_chunk(req, (const char *)buf, (ssize_t)bytesRead);
    }
  }
  free(buf);
  httpd_resp_send_chunk(req, NULL, 0);
  return ESP_OK;
}

void startCameraServer() {
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.max_uri_handlers = 16;

  httpd_uri_t index_uri = {
    .uri = "/",
    .method = HTTP_GET,
    .handler = index_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t status_uri = {
    .uri = "/status",
    .method = HTTP_GET,
    .handler = status_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t cmd_uri = {
    .uri = "/control",
    .method = HTTP_GET,
    .handler = cmd_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t capture_uri = {
    .uri = "/capture",
    .method = HTTP_GET,
    .handler = capture_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t stream_uri = {
    .uri = "/stream",
    .method = HTTP_GET,
    .handler = stream_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t bmp_uri = {
    .uri = "/bmp",
    .method = HTTP_GET,
    .handler = bmp_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t xclk_uri = {
    .uri = "/xclk",
    .method = HTTP_GET,
    .handler = xclk_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t reg_uri = {
    .uri = "/reg",
    .method = HTTP_GET,
    .handler = reg_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t greg_uri = {
    .uri = "/greg",
    .method = HTTP_GET,
    .handler = greg_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t pll_uri = {
    .uri = "/pll",
    .method = HTTP_GET,
    .handler = pll_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t win_uri = {
    .uri = "/resolution",
    .method = HTTP_GET,
    .handler = win_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  ra_filter_init(&ra_filter, 20);

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
  recognizer.set_partition(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, "fr");

  // load ids from flash partition
  recognizer.set_ids_from_flash();
#endif
  // /live handler — combined camera+mic viewer page
  httpd_uri_t live_uri = {
    .uri     = "/live",
    .method  = HTTP_GET,
    .handler = live_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  log_i("Starting web server on port: '%d'", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);

    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &win_uri);

    httpd_register_uri_handler(camera_httpd, &live_uri);
    log_i("Combined viewer at http://<ip>/live");
  }

  config.server_port += 1;
  config.ctrl_port += 1;
  log_i("Starting stream server on port: '%d'", config.server_port);
  if (httpd_start(&stream_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
  }

  // Dedicated audio server on port 82 — long-running PCM stream stays off the
  // control server so camera controls always remain responsive.
  httpd_uri_t audio_uri = {
    .uri     = "/audio",
    .method  = HTTP_GET,
    .handler = audio_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_config_t audio_cfg = HTTPD_DEFAULT_CONFIG();
  audio_cfg.server_port      = 82;
  audio_cfg.ctrl_port        = 32770;  // must be unique across all httpd instances
  audio_cfg.stack_size       = 8192;   // default 4096 too small for streaming handler
  audio_cfg.max_uri_handlers = 2;
  log_i("Starting audio server on port: '%d'", audio_cfg.server_port);
  if (httpd_start(&audio_httpd, &audio_cfg) == ESP_OK) {
    httpd_register_uri_handler(audio_httpd, &audio_uri);
    log_i("Raw PCM audio stream at http://<ip>:82/audio");
  }
}

void setupLedFlash(int pin) {
#if CONFIG_LED_ILLUMINATOR_ENABLED
  ledcAttach(pin, 5000, 8);
#else
  log_i("LED flash is disabled -> CONFIG_LED_ILLUMINATOR_ENABLED = 0");
#endif
}